first_routes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 16], ["LIMIT", 1]]
---
    def index
        artworks = Artwork.where(artist_id: params[:user_id])

INSERT INTO "artworks" ("title", "image_url", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Murakami"], ["image_url", "murakami.com"], ["created_at", "2023-01-12 22:27:08.648922"], ["updated_at", "2023-01-12 22:27:08.648922"], ["artist_id", 16]]
---
     def create
         artwork = Artwork.new(artwork_params)
         if artwork.save