first_routes/app/controllers/comments_controller.rb

    def index
        comments = Comment.where(artwork_id: params[:artwork_id]).or(Comment.where(author_id: params[:user_id]))
---
SELECT "comments".* FROM "comments" WHERE ("comments"."artwork_id" = $1 OR "comments"."author_id" IS NULL)  [["artwork_id", 12]]