first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE ('"Ja"'))
---
    def index
        if params[:query]
            users = User.where("username LIKE ?", "%#{params[:query]}%")
        else
            users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "jasmine@aol.com"], ["updated_at", "2023-01-12 00:39:56.662680"], ["id", 2]]
---
    def update
        user = User.find_by(id: params[:id])
            if user.update(user_params)